Autodesk.Revit.DB.Visual.AssetPropertyEnum.IsValidValue(System.Int32)
Checks that the value is a valid value for this property.
value:
The value to be checked.
Returns:
True if the value is valid for the property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyEnum.Value
The value of the property.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input value is invalid for this AssetPropertyEnum property.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The asset property is not editable.

Autodesk.Revit.DB.Visual.AssetPropertyEnum
Represents a property of material.